# FabricationPartCannotChangeTypeIncompatError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationPartCannotChangeTypeIncompatError Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type either has no material or has badly configured dimensions, resulting in bad geometry. You may try to disconnect the connections on the fitting(s) and try again.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationPartCannotChangeTypeIncompatError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartCannotChangeTypeIncompatError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationPartCannotChangeTypeIncompatError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace